---
layout: post
title: Water Proof 진행상황 (2016/07/14)
---

[https://github.com/datakun/WaterProof](https://github.com/datakun/WaterProof)

1. 캐릭터 이동 기능(캐릭터와 배경이 무한 스크롤로 이동되는 것), 라이프포인트, 플레이타임, 잠수한 깊이를 표시하는 것을 구현했다.
남은 것은 게임 종료 기능, 무작위 맵 생성, 점수 계산, 소소한 게임 완성도인 것 같다.
아, 가장 중요한 게임 리소스(이미지, 사운드)가 남았다. 인터넷에서 구할 수 있는 자료는 단편적인 것밖에 구할 수 없어서 게임 디자인 컨셉과 맞지않아서 직접 그릴수밖에 없을 것 같다.


2. 배경 무한 스크롤은 일주일 전에 마음먹었던 것을 발목 덕분에 집에서 쉬어서 생긴 잉여력으로 구현했다.
이래저래 시도하다가 적절하게 배경 ImageView를 배치하는 방법을 생각해냈고, 후다닥 만들고, 테스트하고, 수정하고, 완성했다.
배경을 무한 스크롤로 이동시키다보니 캐릭터와 배경이 움직이는 모습이 약간 부자연스러워서 핸들러를 좀 더 자주 호출했다.


3. 바로 당장 구현해야하는 일은 맵 생성(장애물, 아이템, 기타 요소 생성)이다.
지금 생각나는 방법은 배경 무한 스크롤 기능과 연동하여 요소들을 만들면 될 것 같다.
문제는 적절한 위치에 배치하는 것, 장애물을 빠져나갈 구멍을 만드는 것, 시간이 혹은 깊이가 깊어질수록 난이도가 높아지는 것?이다.
점점 완성이 되어간다.
올해 안에는 출시할 수 있겠지.


![alt 2016-07-15 01](../images/20160715-01.png)
